Revit 2027 API
ParameterTypeId.FamProfileDefinition Property
 "Profile Definition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamProfileDefinition { get; }
Public Shared ReadOnly Property FamProfileDefinition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamProfileDefinition {
	ForgeTypeId^ get ();
}
static member FamProfileDefinition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace